//Задайте строку, содержащую латинские буквы в обоих регистрах. 
//Сформируйте строку, в которой все заглавные буквы заменены на строчные.
string str = "Hello, my Dear Santa!";
string str1 = str.ToLower();
Console.WriteLine(str);
Console.WriteLine();
Console.WriteLine(str1);